Ran Plan for 2 projects:

1. dir: `staging` workspace: `default`
1. dir: `production` workspace: `default`

### 1. dir: `staging` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_s3_bucket.example will be created
+ resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test-atlantis-resource10"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Dev"
          + "Name"        = "My bucket"
        }
      + tags_all                    = {
          + "Environment" = "Dev"
          + "Name"        = "My bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "ecr_repo" but a value
│ was found in file "staging.tfvars". If you meant to use this value, add a
│ "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d staging`
* :put_litter_in_its_place: To **delete** this plan click [here](https://5bca-2600-4040-20e1-4600-5db1-228d-9502-95c5.ngrok.io/lock?id=codixtechx%252Fterraform%252Fstaging%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d staging`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `production` workspace: `default`
**Plan Error**
```
running "/usr/local/bin/terraform plan -input=false -refresh -out \"/Users/patricelontsikenne/.atlantis/repos/codixtechx/terraform/5/default/production/default.tfplan\" -var-file production.tfvars" in "/Users/patricelontsikenne/.atlantis/repos/codixtechx/terraform/5/default/production": exit status 1
╷
│ Error: Failed to read variables file
│ 
│ Given variables file production.tfvars does not exist.
╵

```

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`